In [22]:
import numpy as np
import pandas as pd
from pandas import DataFrame
from pandas import Series

In [3]:
df = pd.DataFrame({
    'group' : ['a', 'a', 'a', 'b', 'b' , 'b'],
    'value_1' : np.arange(6),
    'value_2' : np.random.randn(6)
})
df

  group  value_1   value_2
0     a        0  0.311474
1     a        1 -1.030318
2     a        2 -0.098815
3     b        3 -1.496862
4     b        4 -0.668870
5     b        5 -1.794463

In [6]:
grouped = df.groupby('group')
grouped

In [9]:
grouped.sum()['value_2']
#grouped['value_2'].sum()

group
a   -0.817659
b   -3.960196
Name: value_2, dtype: float64

In [10]:
pd.DataFrame(grouped.sum()['value_2'])

        value_2
group
a     -0.817659
b     -3.960196

In [11]:
grouped.min()
grouped.max()
grouped.mean()
grouped.median()

       value_1   value_2
group
a            1 -0.098815
b            4 -1.496862

In [14]:
grouped.std()
grouped.var()
grouped.quantile()

0.5    value_1   value_2
group
a          1.0 -0.098815
b          4.0 -1.496862

In [15]:
grouped.first()
grouped.last()

       value_1   value_2
group
a            0  0.311474
b            3 -1.496862

In [16]:
grouped.describe()['value_1']

       count  mean  std  min  25%  50%  75%  max
group
a        3.0   1.0  1.0  0.0  0.5  1.0  1.5  2.0
b        3.0   4.0  1.0  3.0  3.5  4.0  4.5  5.0

In [17]:
grouped.describe()['value_1'].T

group    a    b
count  3.0  3.0
mean   1.0  4.0
std    1.0  1.0
min    0.0  3.0
25%    0.5  3.5
50%    1.0  4.0
75%    1.5  4.5
max    2.0  5.0

In [18]:
def iqr_func(x):
    q3, q1 = np.percentile(x, [75,25])
    iqr = q3 - q1
    return iqr

In [20]:
grouped.agg(iqr_func)

       value_1   value_2
group
a            1  0.670896
b            1  0.562796

In [21]:
grouped.quantile([0.75,0.25])

            value_1   value_2
group
a     0.75      1.5  0.106330
      0.25      0.5 -0.564566
b     0.75      4.5 -1.082866
      0.25      3.5 -1.645663

In [24]:
df = DataFrame(data = np.arange(20).reshape(4,5),
              columns = ['c1', 'c2', 'c3', 'c4', 'c5'],
              index = ['r1', 'r2', 'r3', 'r4'])
df

    c1  c2  c3  c4  c5
r1   0   1   2   3   4
r2   5   6   7   8   9
r3  10  11  12  13  14
r4  15  16  17  18  19

In [27]:
mapping_dict_row = {
    'r1' : 'row_g1',
    'r2' : 'row_g1',
    'r3' : 'row_g2',
    'r4' : 'row_g2',
}
grouped_by_row = df.groupby(mapping_dict_row)
grouped_by_row.sum()

        c1  c2  c3  c4  c5
row_g1   5   7   9  11  13
row_g2  25  27  29  31  33

In [30]:
mapping_dict_col = {
    'c1' : 'col_g1',
    'c2' : 'col_g1',
    'c3' : 'col_g2',
    'c4' : 'col_g2',
    'c5' : 'col_g2',
}
grouped_by_col = df.groupby(mapping_dict_col, axis = 1)
grouped_by_col.sum()

    col_g1  col_g2
r1       1       9
r2      11      24
r3      21      39
r4      31      54

In [33]:
mapping_series_row = Series(mapping_dict_row)
df.groupby(mapping_series_row).sum()

        c1  c2  c3  c4  c5
row_g1   5   7   9  11  13
row_g2  25  27  29  31  33

In [35]:
mapping_series_col = Series(mapping_dict_col)
df.groupby(mapping_series_col, axis=1).sum()

    col_g1  col_g2
r1       1       9
r2      11      24
r3      21      39
r4      31      54

In [37]:
df.groupby(mapping_dict_col, axis=1).mean()

    col_g1  col_g2
r1     0.5     3.0
r2     5.5     8.0
r3    10.5    13.0
r4    15.5    18.0

In [38]:
mapping_list_col = ['col_g1', 'col_g1', 'col_g2', 'col_g2', 'col_g2'] #list
df.groupby(mapping_list_col, axis=1).mean()

    col_g1  col_g2
r1     0.5     3.0
r2     5.5     8.0
r3    10.5    13.0
r4    15.5    18.0

In [39]:
df

    c1  c2  c3  c4  c5
r1   0   1   2   3   4
r2   5   6   7   8   9
r3  10  11  12  13  14
r4  15  16  17  18  19

In [41]:
def row_grp_func(x):
    if x == 'r1' or x == 'r2':
        row_group = 'row_g1'
    else:
        row_group = 'row_g2'
    return row_group

df.groupby(row_grp_func).sum()

        c1  c2  c3  c4  c5
row_g1   5   7   9  11  13
row_g2  25  27  29  31  33

In [43]:
hier_columns = pd.MultiIndex.from_arrays([
    ['col_g1', 'col_g1', 'col_g2', 'col_g2', 'col_g2'],
    ['c1', 'c2', 'c3', 'c4', 'c5']],
    names = ['col_level_1', 'col_level_2'])
hier_columns

MultiIndex(levels=[['col_g1', 'col_g2'], ['c1', 'c2', 'c3', 'c4', 'c5']],
           codes=[[0, 0, 1, 1, 1], [0, 1, 2, 3, 4]],
           names=['col_level_1', 'col_level_2'])

In [48]:
hier_df = DataFrame(data = np.arange(20).reshape(4,5),
                    columns = hier_columns,
                    index = ['r1', 'r2', 'r3', 'r4'])
hier_df

col_level_1 col_g1     col_g2
col_level_2     c1  c2     c3  c4  c5
r1               0   1      2   3   4
r2               5   6      7   8   9
r3              10  11     12  13  14
r4              15  16     17  18  19

In [49]:
hier_df.groupby(level='col_level_1', axis=1).mean()

col_level_1  col_g1  col_g2
r1              0.5     3.0
r2              5.5     8.0
r3             10.5    13.0
r4             15.5    18.0

# refered by https://rfriend.tistory.com/391